-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2020-10-27 09:18:09
-- 伺服器版本： 10.4.13-MariaDB
-- PHP 版本： 7.3.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `mfee09_project`
--

-- --------------------------------------------------------

--
-- 資料表結構 `msgboard`
--

CREATE TABLE `msgboard` (
  `sid` int(11) NOT NULL COMMENT '留言編號',
  `typeId` int(11) NOT NULL DEFAULT 0 COMMENT '對應頻道(文章)ID',
  `parnentId` int(11) NOT NULL COMMENT '0=主留言',
  `memberId` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '會員Id',
  `nickname` varchar(255) COLLATE utf8_unicode_ci NOT NULL COMMENT '會員暱稱',
  `content` text COLLATE utf8_unicode_ci NOT NULL COMMENT '留言內容',
  `upPoint` int(11) NOT NULL DEFAULT 0 COMMENT '讚分',
  `downPoint` int(11) NOT NULL DEFAULT 0 COMMENT '噓分',
  `accusePoint` int(11) NOT NULL DEFAULT 0 COMMENT '檢舉分數',
  `postTime` datetime NOT NULL COMMENT '發表時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- 傾印資料表的資料 `msgboard`
--

INSERT INTO `msgboard` (`sid`, `typeId`, `parnentId`, `memberId`, `nickname`, `content`, `upPoint`, `downPoint`, `accusePoint`, `postTime`) VALUES
(1, 0, 0, '87778746', '台中恐龍妹', '有關台幣升值對電子股的影響，美系外資今天對華碩出具一分報告，說臺幣升值對華碩有利，這邏輯對嗎？請解析！華碩被列為注意股，被借券賣出過高，這對股價有什麼影響？您對華碩未來業務成長的看法？', 5786, 2600, 0, '2020-10-26 01:00:02'),
(2, 0, 0, '32954597', '台北菜雞', '五星推爆優質好節目，謝謝癌大花時間經營podcast 還有開telegram讓菜雞們有交流的地方～ 可不可以請癌大分享一下自己是如何把本金加大的經驗呢？知道癌大之前是有正職工作來累積本金，除了這些以外，還有再用其他方式（像投資副業或是其他方法）讓自己可以有更多本金來交易嗎？同意癌大說的美股比台股好操作太多了，台股一直處在帳戶損益是以0.0x%增長，滿考驗耐心的。。。謝謝癌大說分享，祝一切順心 （還有可以用well-behaved 來稱讚乖狗狗哦～）', 982, 5024, 0, '2020-10-26 01:01:08'),
(3, 0, 0, '32266595', 'LaxJJ', '在上幾集聽到癌大說想打爆躁音仔真是有感而發，為什麼世界上有這麼多垃圾躁音仔在製造噪音卻沒半個政治人物跳出來說要立法呢？尤其是小弟我現在住的地方樓上就一個白目仔，過了10點還在蹦蹦跳跳，跟他反應過後，只得到道歉然後說小孩還小啦沒辦法囉（他只是個孩子啊？）', 7888, 9760, 0, '2020-10-26 01:06:41'),
(4, 0, 0, '51586288', '貓奴先生', '收穫蠻多的，感謝癌大開示', 7283, 939, 0, '2020-10-26 01:09:01'),
(5, 0, 0, '28502676', '被外派的菜雞', '在其他的podcast中聽到主委的節目，剛好這幾個月開始觀察股票市場（目前未入場小菜雞）～想問問看主委有涉略港股嗎？對於目前局勢如何看待港股市場？感謝主委～', 1431, 8606, 0, '2020-10-26 01:09:01'),
(6, 0, 0, '74500606', 'Charlie@TP', '股癌大您好，\r\n\r\n\r\n之前對於您在勞工議題上站在左派的立場，並能夠挺身而出地發聲幹譙，感到非常敬佩。大叔我過去10多年曾經服務過幾家國際知名的網路公司以及台灣大型金控；最近遇到某大型金控相關單位挖角，也順利獲得入取。但對方offer竟僅承認我我在過去金融業的年資（約2年），並認為以2年的年資，給我的offer已經該謝主隆恩，沒有討論的空間，最後我也理所當然地拒絕了這個offer。有了這個經驗後，我更加支持癌大對勞工議題的發聲。但，慣老闆之所以賺錢，就是因為他慣，期待他改變完全是不切實際的想法，不如靠自己。好在大叔我過去一直有進行股票投資，績效也有一定的水準以上；自己目前也在找題目自行創業中，期望可以跟癌大一樣，走出一條不一樣的道路，打倒資本主義的高牆，打爆慣老闆，也祝福該公司順利找到便宜好用的員工。', 7929, 7297, 0, '2020-10-26 01:10:02'),
(7, 0, 0, '87894972', '阿水0816', '從今年八月才開始聽股癌，目前還是個看戲的汁男，沒甚麼問題要問純粹送上我的五星吹捧', 9550, 1383, 0, '2020-10-26 01:16:02'),
(8, 0, 0, '82672989', '偷尼', '最近大立光大澇賽，月線也到低點\r\n是否是別人恐懼我貪婪的最佳時機？！', 7185, 1124, 0, '2020-10-26 01:16:02'),
(9, 0, 1, '98521415', '小港', '癌大好人一生平安', 9836, 9627, 0, '2020-10-26 01:17:28'),
(10, 0, 1, '86265223', 'fan', 'Post malone 的歌真滴讚', 4250, 5373, 0, '2020-10-26 01:17:28'),
(11, 0, 0, '78660210', 'DVshu', '先吹一波吹上天！\r\n\r\n感謝癌大的知識分享，讓小菜雞我面對近期美股波動，還能夠保持冷靜。', 8988, 1344, 0, '2020-10-26 01:19:10'),
(12, 0, 0, '97581086', '五歲喝啤酒', '想請問主委對台灣數位銀行未來是否看好？', 4756, 4506, 0, '2020-10-26 01:19:10'),
(13, 0, 0, '37503149', '恰克與大鳥', '五星推推推推喵喵喵~', 2165, 9576, 0, '2020-10-26 03:25:05'),
(14, 0, 0, '13879855', '隱藏阿宅', '感謝癌大每週的分享', 8209, 6881, 0, '2020-10-26 03:25:05'),
(15, 0, 0, '50049284', '臺北周楊青', '股癌大大可以講國巨嗎？', 6022, 5096, 0, '2020-10-26 03:26:17'),
(16, 0, 0, '74166094', '蔡阿雞', '身邊比較少朋友在討論股票 有幸可以聽到節目癌大對菜逼八的投資心法做一些教訓 讓我有正確的觀念(不要動不動就追高低賣等) 不像電視上的老師真的會很讓人失心瘋的跟單', 1792, 6714, 0, '2020-10-26 03:26:17'),
(17, 0, 0, '81957081', '正義豪', '第一次留言，股癌的節目輕鬆又專業，節目節奏非常好，快速又不會聽不懂。真心希望一週三則', 833, 9581, 0, '2020-10-26 03:26:17'),
(18, 0, 0, '78180055', '妹肚', '五星吹捧 又吹又捧再吹再捧', 7070, 1896, 0, '2020-10-26 03:27:45'),
(19, 0, 0, '82725038', 'Cyril_Hsia', '請問股癌大大是怎麼觀察一檔股票的動能呢？謝謝股癌大，五星吹爆', 5672, 3546, 0, '2020-10-26 03:27:45'),
(20, 0, 0, '7141743', '定壘', '主委請繼續維持一貫的態度佼正～不愛聽的就滾～都去吼幹啦', 2931, 2514, 0, '2020-10-26 03:27:45'),
(21, 0, 0, '21620515', 'linwenjiun', '我老公美國黑人，他很明顯感受到川執政這幾年薪資工作真的有大幅的提昇', 1405, 539, 0, '2020-10-26 03:30:54'),
(22, 0, 0, '84808636', 'MichaelYang', '于將軍這集真的非常有意義，在藍綠之間取得了很好的平衡點。', 786, 8490, 0, '2020-10-26 03:30:54'),
(23, 0, 0, '937164', '台北小當家', '還敢在那大放厥詞', 4996, 4700, 0, '2020-10-26 03:30:54'),
(24, 0, 0, '69796414', 'jamin0911', '喜歡你們的做自己，與所有的爭執討論掙扎，能看見你們的思想，能聚集喜歡你們的我們', 5284, 5483, 0, '2020-10-26 03:32:28'),
(25, 0, 0, '15653473', 'vrpmknd', '嗯嗯', 1375, 2180, 0, '2020-10-26 03:32:28'),
(26, 0, 0, '67774851', 'ttoo222', '很有趣的世代、族群、理念間的碰撞與溝通，', 7345, 6394, 0, '2020-10-26 03:32:28');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `msgboard`
--
ALTER TABLE `msgboard`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `msgboard`
--
ALTER TABLE `msgboard`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT COMMENT '留言編號', AUTO_INCREMENT=27;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
